qodome/Firmware/iQo/IQ14BLW/nrf51/iQoApp/main.c
#define UUID16_EXTRACT(DST,SRC)                                                                  \
        do                                                                                       \
        {                                                                                        \
            (*(DST)) = (SRC)[1];                                                                 \
            (*(DST)) <<= 8;                                                                      \
            (*(DST)) |= (SRC)[0];                                                                \
        } while(0)

ble_sensor_t m_sensor;
static ble_led_t m_led;
static ble_iqo_t m_iqo;
static ble_memdump_t m_memdump;
static ble_gap_scan_params_t m_scan_param;
static app_timer_id_t m_watchdog_timer_id;

uint16_t error_cnt = 0;
uint32_t last_error_code = 0;
uint8_t *last_error_file_name = NULL;
uint8_t flash_write_w_backup_status = 0;
uint8_t flash_write_w_backup_data[24];

uint16_t temp_notify_cnt = 0;
uint16_t acc_notify_cnt = 0;

extern ble_iqo_id_t iqo_tgt_identify;
extern uint8_t debug_cnt[16];

static const ble_gap_conn_params_t m_connection_param =
{
    (uint16_t)PERIPHERAL_AND_MIN_CONN_INTERVAL,     // Minimum connection
    (uint16_t)PERIPHERAL_AND_MAX_CONN_INTERVAL,     // Maximum connection
    (uint16_t)PERIPHERAL_AND_SLAVE_LATENCY,         // Slave latency
    (uint16_t)PERIPHERAL_AND_CONN_SUP_TIMEOUT       // Supervision time-out
};

/*****************************************************************************
* Functions and structures related to connection and buffers
*****************************************************************************/
typedef struct {
    uint16_t                conn_handle;
    uint16_t                descriptor_handle;
    ble_db_discovery_t      db_discovery;
    ble_iqo_c_t             iqo_c;
} peripheral_t;

peripheral_t gs_peripheral[NUMBER_OF_PERIPHERALS];

typedef struct
{
    uint16_t conn_handle;
    uint8_t  notification_enabled;
    uint8_t  cpu_request_done;
} central_t;

central_t gs_central;
static bool gs_advertising_is_running = false;

// All flash log operations shall happen in scheduler context
static void app_log_error(void * p_event_data , uint16_t event_size)
{
	uint32_t *ptr;

    ptr = (uint32_t *)p_event_data;
	persistent_record_error((uint8_t)ptr[0], ptr[1]);
}

// Application error handler
void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name)
{
    static uint32_t error_buf[2];

	error_cnt++;
	last_error_code = error_code;
	last_error_file_name = (uint8_t *)p_file_name;

	if ((uint8_t)error_code >= PERSISTENT_ERROR_SYS_MAX) {
		error_buf[0] = PERSISTENT_ERROR_SYS_MAX;
	} else {
		error_buf[0] = (uint8_t)error_code;
	}
	error_buf[1] = (line_num & 0x0000FFFF) | (((uint32_t)p_file_name & 0x0000FFFF) << 16);

	app_sched_event_put((void *)&(error_buf[0]), 8, app_log_error);
}

// SoftDevice
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    persistent_record_error(PERSISTENT_ERROR_DEADBEEF, (uint32_t)line_num);
	for(;;);
}

// Start scan for device
void scan_start(void)
{
    m_scan_param.active = 1;
    m_scan_param.selective = 0;
    m_scan_param.interval = SCAN_INTERVAL;
    m_scan_param.window = SCAN_WINDOW;
    m_scan_param.p_whitelist = NULL;
    m_scan_param.timeout = 0x0000;

    APP_ERROR_CHECK(sd_ble_gap_scan_start(&m_scan_param));
}

void disconnect_peer(void)
{
	if (gs_peripheral[0].conn_handle != BLE_CONN_HANDLE_INVALID) {
		APP_ERROR_CHECK(sd_ble_gap_disconnect(gs_peripheral[0].conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION));
	}
}

#define INVALID_DESCRIPTOR_HANDLE 0
#define ID_NOT_FOUND 0xFFFF

// Reset information about peer central
static void central_info_reset(void)
{
    memset((void*)&gs_central, 0, sizeof(central_t));
    gs_central.conn_handle = BLE_CONN_HANDLE_INVALID;
    gs_central.notification_enabled = 0;
    gs_central.cpu_request_done  = 0;
}

static void peripheral_info_reset(uint16_t peripheral_id)
{
    if (peripheral_id < NUMBER_OF_PERIPHERALS) {
        memset((void*)&(gs_peripheral[peripheral_id]), 0, sizeof(peripheral_t));
        gs_peripheral[peripheral_id].conn_handle = BLE_CONN_HANDLE_INVALID;
        gs_peripheral[peripheral_id].descriptor_handle = INVALID_DESCRIPTOR_HANDLE;
    }
}

/**@brief Function resets structure that keep information about peer peripherals.
*/
static void peripherals_info_reset(void)
{
    uint16_t peripheral_id = ID_NOT_FOUND;

    for (peripheral_id = 0; peripheral_id < NUMBER_OF_PERIPHERALS; peripheral_id++) {
        peripheral_info_reset(peripheral_id);
    }
}

// Query peripheral ID
static uint16_t peripheral_id_get(uint16_t conn_handle)
{
    uint8_t i = 0;

    for (i = 0; i < NUMBER_OF_PERIPHERALS; i++) {
        if (conn_handle == gs_peripheral[i].conn_handle) {
            return i;
        }
    }
    return ID_NOT_FOUND;
}

// Get available peripheral ID
static uint16_t peripheral_get_available_id(void)
{
    for (uint8_t i = 0; i < NUMBER_OF_PERIPHERALS; i++) {
        if (gs_peripheral[i].conn_handle == BLE_CONN_HANDLE_INVALID) {
            return i;
        }
    }
    return ID_NOT_FOUND;
}

ble_iqo_c_t *peripheral_get_iqo_c(uint16_t conn_handle)
{
    for (uint8_t i = 0; i < NUMBER_OF_PERIPHERALS; i++) {
        if (gs_peripheral[i].conn_handle == conn_handle) {
            return &(gs_peripheral[i].iqo_c);
        }
    }
    return NULL;
}

ble_db_discovery_t *peripheral_get_db(uint16_t conn_handle)
{
    for (uint8_t i = 0; i < NUMBER_OF_PERIPHERALS; i++) {
        if (gs_peripheral[i].conn_handle == conn_handle) {
            return &(gs_peripheral[i].db_discovery);
        }
    }
    return NULL;
}

bool is_central(uint16_t conn_handle)
{
    if (conn_handle == gs_central.conn_handle) {
        return true;
    } else {
        return false;
    }
}

/*****************************************************************************
* GAP events handling
*****************************************************************************/

/**@brief Function that handles BLE connect event for peer Central
 *
 * @param[in]   p_ble_evt        Pointer to buffer filled in with an event.
*/
static void connect_peer_central(ble_evt_t *p_ble_evt)
{
    if (gs_central.conn_handle == BLE_CONN_HANDLE_INVALID) {
        gs_central.conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
        gs_advertising_is_running = false;
    }
}

static void on_sensor_evt(ble_sensor_t * p_sensor, ble_sensor_evt_t *p_evt)
{
	switch (p_evt->evt_type)
	{
	case BLE_SENSOR_EVT_NOTIFICATION_ENABLED:
		ss_isl_start();
		trigger_rt5350_reset();
		break;

