qodome/Firmware/iQo/IQ14BLW/nrf51/iQoApp/main.c
	case BLE_SENSOR_EVT_NOTIFICATION_DISABLED:
		ss_isl_stop();
		break;

	default:
		// No implementation needed.
		break;
	}
}

/*****************************************************************************
* Functions related to service setup, advertisement, discovery, device connection
*****************************************************************************/
/**@brief Function steup own service to be used to notify average values to peer central.
 *
 * Function does not return error code. If any internal call failes it triggers APP_ASSERT.
*/
static void services_init(void)
{
    ble_sensor_init_t   sensor_init;

    // Initialize Sensor Service
    memset(&sensor_init, 0, sizeof(sensor_init));
    sensor_init.evt_handler = on_sensor_evt;

    APP_ERROR_CHECK(ble_iqo_init(&m_iqo));
    APP_ERROR_CHECK(ble_memdump_init(&m_memdump));
    APP_ERROR_CHECK(ble_led_init(&m_led));
    APP_ERROR_CHECK(ble_sensor_init(&m_sensor, &sensor_init));
    APP_ERROR_CHECK(ble_iqo_c_setup());
}

// Watchdog timeout handler
static void watchdog_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    NRF_WDT->RR[0] = 0x6E524635;  //Reload watchdog register 0
}

// Initialize timer module
static void timers_init(void)
{
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, false);

    // Create watchdog timer.
    APP_ERROR_CHECK(app_timer_create(&m_watchdog_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                watchdog_timeout_handler));
    APP_ERROR_CHECK(app_timer_start(m_watchdog_timer_id, WATCHDOG_KICK_PERIOD, NULL));
}

static void iqo_c_evt_handler(ble_iqo_c_t * p_iqo_c, ble_iqo_c_evt_t * p_iqo_c_evt)
{
    switch (p_iqo_c_evt->evt_type) {
        case BLE_IQO_C_EVT_DISCOVERY_TEMP_COMPLETE:
            APP_ERROR_CHECK(ble_iqo_c_temp_enable(p_iqo_c));
            debug_cnt[12]++;
            break;

        case BLE_IQO_C_EVT_IT_NOTIFY:
        	temp_notify_cnt++;
        	debug_cnt[13]++;
            break;

        case BLE_IQO_C_EVT_DISCOVERY_ACC_COMPLETE:
            APP_ERROR_CHECK(ble_iqo_c_acc_enable(p_iqo_c));
            debug_cnt[14]++;
            break;

        case BLE_IQO_C_EVT_ACC_NOTIFY:
            acc_notify_cnt++;
            intermcu_notify(NRF_ACC_NOTIFY, NULL, 0);
            debug_cnt[15]++;
            break;

        default:
            break;
    }
}

static void iqo_c_init(uint16_t conn_handle)
{
    ble_iqo_c_init_t iqo_c_init_obj;
    uint16_t peripheral_id = peripheral_id_get(conn_handle);

    iqo_c_init_obj.evt_handler = iqo_c_evt_handler;

    uint32_t err_code = ble_iqo_c_init(conn_handle,
                                        (peripheral_id == ID_NOT_FOUND) ? NULL : &(gs_peripheral[peripheral_id].iqo_c),
                                        &iqo_c_init_obj);
    APP_ERROR_CHECK(err_code);
}

static void on_ble_evt(ble_evt_t * p_ble_evt)
{
	uint16_t peripheral_id = ID_NOT_FOUND;
    const ble_gap_evt_t *p_gap_evt = &p_ble_evt->evt.gap_evt;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_ADV_REPORT:
        	// Check scan response with full name
        	if (p_gap_evt->params.adv_report.scan_rsp == 1 && p_gap_evt->params.adv_report.data[1] == 0x09) {
        		if (memcmp(&(p_gap_evt->params.adv_report.data[2]), &(iqo_tgt_identify.id[0]), (uint32_t)(p_gap_evt->params.adv_report.data[0] - 1)) == 0 &&
        			iqo_tgt_identify.id[p_gap_evt->params.adv_report.data[0] - 1] == 0) {
            		// Stop scan
            		APP_ERROR_CHECK(sd_ble_gap_scan_stop());

            		// Initiate connection.
            		APP_ERROR_CHECK(sd_ble_gap_connect(&p_gap_evt->params.adv_report.peer_addr,
            											&m_scan_param,
            		                                    &m_connection_param));

        		}
        	}
            break;

        case BLE_GAP_EVT_CONNECTED:
            if (p_ble_evt->evt.gap_evt.params.connected.role == BLE_GAP_ROLE_PERIPH) {
                // Peer is central, we are peripheral
                connect_peer_central(p_ble_evt);
            } else {
                // Connected to peer peripheral
                uint16_t next_id = 0;

                next_id = peripheral_get_available_id();
                if (next_id != ID_NOT_FOUND) {
                    gs_peripheral[next_id].conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
                }

                // Initialize collector
                iqo_c_init(p_ble_evt->evt.gap_evt.conn_handle);

                debug_cnt[0]++;
            }
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            if (is_central(p_ble_evt->evt.gap_evt.conn_handle)) {
                // Disconnected with peer central
                // Check p_ble_evt->evt.gap_evt.params.disconnected.reason ??
                central_info_reset();
                advertising_start();
            } else {
            	if ((peripheral_id = peripheral_id_get(p_ble_evt->evt.gap_evt.conn_handle)) != ID_NOT_FOUND) {
            		peripheral_info_reset(peripheral_id);
            	}
            	scan_start();
            	debug_cnt[1]++;
            }
            break;

        case BLE_GAP_EVT_TIMEOUT:
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
        	sd_ble_gatts_sys_attr_set(p_ble_evt->evt.gatts_evt.conn_handle, NULL, 0);
        	break;

        default:
            // No implementation needed.
            break;
    }
}

static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    uint16_t peripheral_id;

    on_ble_evt(p_ble_evt);
    peripheral_id = peripheral_id_get(p_ble_evt->evt.common_evt.conn_handle);
    ble_db_discovery_on_ble_evt((peripheral_id == ID_NOT_FOUND) ? NULL : &(gs_peripheral[peripheral_id].db_discovery), p_ble_evt);
	ble_memdump_on_ble_evt(&m_memdump, p_ble_evt);
    ble_conn_params_on_ble_evt(p_ble_evt);
    ble_iqo_c_on_ble_evt((peripheral_id == ID_NOT_FOUND) ? NULL : &(gs_peripheral[peripheral_id].iqo_c), p_ble_evt);
    ble_led_on_ble_evt(&m_led, p_ble_evt);
    ble_sensor_on_ble_evt(&m_sensor, p_ble_evt);
    ble_iqo_on_ble_evt(&m_iqo, p_ble_evt);
}

static void check_flash_status(void * p_event_data , uint16_t event_size)
{
	uint32_t event;

	event = *(uint32_t *)p_event_data;
    flash_helper_sys_event(event);
}

static void on_sys_evt(uint32_t sys_evt)
{
	static uint32_t evt= 0;

	evt = sys_evt;
    switch(sys_evt) {
    	case NRF_EVT_FLASH_OPERATION_SUCCESS:
    	case NRF_EVT_FLASH_OPERATION_ERROR:
    	    APP_ERROR_CHECK(app_sched_event_put((void *)&evt, sizeof(evt), check_flash_status));
    		break;

        default:
            break;
    }
}

static void sys_evt_dispatch(uint32_t sys_evt)
{
    on_sys_evt(sys_evt);
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_RC_250_PPM_8000MS_CALIBRATION, false);

